<template>
	<footer class="the-footer center" id="footer">
		<div class="the-footer__top">
			<div
				data-aos="fade-up"
				data-aos-anchor-placement="top-bottom"
				class="the-footer__socials"
			>
				<p>Соцсети</p>
				<div class="the-footer__socials-group">
					<a
						href="https://wa.me/79616670163"
						target="_blank"
						class="the-footer__social"
					>
						<svg
							width="30"
							height="31"
							viewBox="0 0 30 31"
							fill="none"
							xmlns="http://www.w3.org/2000/svg"
						>
							<path
								fill-rule="evenodd"
								clip-rule="evenodd"
								d="M15.1888 0.609619C7.18505 0.609619 0.671994 7.09976 0.671994 15.1264C0.671994 17.8784 1.42879 20.424 2.75893 22.6256L0.144531 30.4L8.17119 27.8315C10.2581 28.9781 12.6432 29.6432 15.1888 29.6432C23.1925 29.6432 29.7056 23.1531 29.7056 15.1264C29.7056 7.09976 23.2154 0.609619 15.1888 0.609619ZM15.1888 27.1893C12.7349 27.1893 10.4416 26.4555 8.53812 25.1941L3.90559 26.6848L5.41919 22.1899C3.97439 20.1947 3.12586 17.7408 3.12586 15.1035C3.12586 8.45283 8.53812 3.01762 15.2117 3.01762C21.8624 3.01762 27.2976 8.42989 27.2976 15.1035C27.2746 21.7771 21.8624 27.1893 15.1888 27.1893ZM22 18.4059C21.633 18.1995 19.8442 17.2363 19.5232 17.0987C19.1792 16.9611 18.9498 16.8923 18.6746 17.2592C18.4224 17.6262 17.6656 18.4288 17.4592 18.6581C17.2298 18.8875 17.0234 18.9104 16.6565 18.7269C16.2896 18.5205 15.12 18.0848 13.744 16.7776C12.689 15.7456 11.9781 14.5072 11.7717 14.1403C11.5653 13.7504 11.7717 13.567 11.9552 13.3835C12.1386 13.223 12.345 12.9707 12.5285 12.7643C12.712 12.5579 12.7808 12.3973 12.9184 12.168C13.056 11.9157 12.9872 11.7094 12.9184 11.5259C12.8266 11.3424 12.1616 9.48481 11.8864 8.72801C11.6112 7.97122 11.2901 8.0859 11.0837 8.0859C10.8773 8.0859 10.625 8.04002 10.3728 8.04002C10.1205 8.04002 9.73065 8.10882 9.36372 8.47575C9.01972 8.84269 8.01065 9.69123 7.94185 11.5259C7.87305 13.3376 9.13439 15.1493 9.31785 15.4016C9.50132 15.6539 11.7258 19.5984 15.441 21.2267C19.1562 22.8549 19.1792 22.3504 19.8442 22.3275C20.5322 22.2816 22.0688 21.5019 22.4128 20.6533C22.7568 19.8048 22.7797 19.048 22.688 18.9104C22.5962 18.704 22.3669 18.6123 22 18.4059Z"
								fill="#007BFC"
							/>
						</svg>
					</a>
					<!-- <a
						href="https://instagram.com/3dom_vlg?utm_medium=copy_link"
						target="_blank"
						class="the-footer__social"
					>
						<svg
							width="31"
							height="31"
							viewBox="0 0 31 31"
							fill="none"
							xmlns="http://www.w3.org/2000/svg"
						>
							<path
								d="M15.8305 3.29257C19.8209 3.29257 20.2795 3.31551 21.8619 3.38431C23.3067 3.45311 24.1094 3.68244 24.6369 3.88884C25.3249 4.16404 25.8294 4.4851 26.3569 5.01257C26.8843 5.54004 27.2054 6.02164 27.4806 6.73257C27.687 7.26003 27.9393 8.03977 27.9851 9.5075C28.0539 11.0899 28.0769 11.5486 28.0769 15.539C28.0769 19.5294 28.0539 19.988 27.9851 21.5704C27.9163 23.0152 27.687 23.8179 27.4806 24.3453C27.2054 25.0333 26.8843 25.5379 26.3569 26.0653C25.8294 26.5928 25.3478 26.9139 24.6369 27.1891C24.1094 27.3955 23.3297 27.6477 21.8619 27.6936C20.2795 27.7624 19.8209 27.7853 15.8305 27.7853C11.8401 27.7853 11.3814 27.7624 9.79903 27.6936C8.35424 27.6248 7.55155 27.3955 7.02408 27.1891C6.33608 26.9139 5.83155 26.5928 5.30408 26.0653C4.77662 25.5379 4.45557 25.0563 4.18037 24.3453C3.97397 23.8179 3.72169 23.0381 3.67582 21.5704C3.60702 19.988 3.58409 19.5294 3.58409 15.539C3.58409 11.5486 3.60702 11.0899 3.67582 9.5075C3.74462 8.0627 3.97397 7.26003 4.18037 6.73257C4.45557 6.04457 4.77662 5.54004 5.30408 5.01257C5.83155 4.4851 6.31315 4.16404 7.02408 3.88884C7.55155 3.68244 8.3313 3.43017 9.79903 3.38431C11.3814 3.31551 11.8401 3.29257 15.8305 3.29257ZM15.8305 0.609375C11.7713 0.609375 11.2668 0.632309 9.68437 0.701109C8.10197 0.769908 7.00116 1.02217 6.06089 1.38911C5.07476 1.77897 4.24916 2.28351 3.42356 3.1091C2.59796 3.9347 2.09343 4.7603 1.70357 5.74643C1.33663 6.6867 1.08437 7.7875 1.01557 9.3699C0.946767 10.9523 0.923828 11.4798 0.923828 15.516C0.923828 19.5752 0.946767 20.0798 1.01557 21.6621C1.08437 23.2445 1.33663 24.3453 1.70357 25.2856C2.09343 26.2717 2.59796 27.0973 3.42356 27.9229C4.24916 28.7485 5.07476 29.2531 6.06089 29.6429C7.00116 30.0099 8.10197 30.2621 9.68437 30.3309C11.2668 30.3997 11.7942 30.4227 15.8305 30.4227C19.8897 30.4227 20.3942 30.3997 21.9766 30.3309C23.559 30.2621 24.6598 30.0099 25.6001 29.6429C26.5862 29.2531 27.4118 28.7485 28.2374 27.9229C29.063 27.0973 29.5675 26.2717 29.9574 25.2856C30.3243 24.3453 30.5766 23.2445 30.6454 21.6621C30.7142 20.0798 30.7371 19.5523 30.7371 15.516C30.7371 11.4798 30.7142 10.9523 30.6454 9.3699C30.5766 7.7875 30.3243 6.6867 29.9574 5.74643C29.5675 4.7603 29.063 3.9347 28.2374 3.1091C27.4118 2.28351 26.5862 1.77897 25.6001 1.38911C24.6598 1.02217 23.559 0.769908 21.9766 0.701109C20.3942 0.632309 19.8897 0.609375 15.8305 0.609375Z"
								fill="#007BFC"
							/>
							<path
								d="M15.8316 7.87939C11.5889 7.87939 8.17188 11.3194 8.17188 15.5391C8.17188 19.7588 11.6119 23.1988 15.8316 23.1988C20.0743 23.1988 23.4913 19.7588 23.4913 15.5391C23.4913 11.3194 20.0743 7.87939 15.8316 7.87939ZM15.8316 20.5156C13.0796 20.5156 10.8551 18.2911 10.8551 15.5391C10.8551 12.7871 13.0796 10.5626 15.8316 10.5626C18.5836 10.5626 20.8081 12.7871 20.8081 15.5391C20.8081 18.2911 18.5836 20.5156 15.8316 20.5156Z"
								fill="#007BFC"
							/>
							<path
								d="M23.7888 9.34713C24.7767 9.34713 25.5776 8.54625 25.5776 7.55833C25.5776 6.5704 24.7767 5.76953 23.7888 5.76953C22.8009 5.76953 22 6.5704 22 7.55833C22 8.54625 22.8009 9.34713 23.7888 9.34713Z"
								fill="#007BFC"
							/>
						</svg>
					</a> -->
					<a
						href="https://t.me/tridom_vlg"
						class="the-footer__social the-footer__tg"
						target="_blank"
					>
						<svg
							width="28"
							height="24"
							viewBox="0 0 28 24"
							fill="none"
							xmlns="http://www.w3.org/2000/svg"
						>
							<path
								d="M26.136 0.195049L1.05653 9.82201C-0.317121 10.2231 -0.275495 11.5954 0.744336 11.9332L7.02981 13.9177L9.44412 21.3912C9.7355 22.2146 9.98525 22.5101 10.4848 22.5312C11.0051 22.5312 11.2132 22.3412 11.7543 21.8557C12.3995 21.2434 13.3569 20.2934 14.8971 18.7733L21.4323 23.6713C22.6395 24.3469 23.5136 23.9879 23.805 22.5312L27.9051 1.96844C28.3214 0.195054 27.3016 -0.332744 26.136 0.195049ZM8.02884 13.4532L22.3065 4.37518C23.0141 3.88961 23.2222 4.43851 22.91 4.79741L11.0467 15.6066L10.4431 21.0112L8.02884 13.4532Z"
								fill="#007BFC"
							/>
						</svg>
					</a>
				</div>
			</div>
			<ul
				data-aos="fade-up"
				data-aos-anchor-placement="top-bottom"
				class="the-footer__links"
			>
				<li class="the-footer__link">
					<a href="#" target="_blank">О компании</a>
				</li>
				<li class="the-footer__link">
					<a href="#" target="_blank">Новости</a>
				</li>
				<li class="the-footer__link">
					<a href="#" target="_blank">Финансы</a>
				</li>
				<li class="the-footer__link">
					<router-link :to="{ name: 'TradeIn' }">
						Trade-in
					</router-link>
				</li>
				<li class="the-footer__link">
					<a href="#" target="_blank">Реквизиты</a>
				</li>
				<li class="the-footer__link">
					<a href="#" target="_blank">Вакансии</a>
				</li>

				<li class="the-footer__link">
					<router-link
						:to="{
							name: 'Academ',
							query: { section: '#feedback' },
						}"
					>
						Офисы продаж
					</router-link>
				</li>
			</ul>
		</div>
		<div
			data-aos="fade-up"
			data-aos-anchor-placement="top-bottom"
			class="the-footer__disclaimer"
		>
			<p>
				Любая информация, представленная на данном сайте, носит
				исключительно информационный характер и ни при каких условиях не
				является публичной офертой, определяемой положениями статьи 437
				ГК РФ. Информация ПАО «ООООООО»,<br />
				раскрываемая в соответствии с Положением о раскрытии информации
				эмитентами эмиссионных ценных бумаг (утв. Банком России
				30.12.2014 N 454-П), размещена на странице Центра раскрытия
				корпоративной информации Интерфакс в сети Интернет
			</p>
		</div>
	</footer>
</template>

<script>
	export default {
		name: "TheFooter",
	};
</script>

<style lang="scss" scoped>
	@import "@/assets/scss/variables";

	.the-footer {
		overflow: hidden;
		padding: 0 1.5rem;
		&__top {
			display: flex;
			justify-content: center;
			gap: 5rem;
			font-size: 1.6rem;
			color: $dark;
			height: 4rem;

			p {
				font-weight: 600;
				margin-right: 1rem;
			}
		}
		&__socials {
			display: flex;
			align-items: center;
			max-height: 4rem;
			gap: 1rem;
			&-group {
				display: flex;
				align-items: center;
				gap: 2rem;
			}
			a {
				height: 3rem;
				img {
					height: 100%;
				}
			}
		}
		&__social {
			display: flex;
			justify-content: center;
			align-items: center;
		}
		&__links {
			display: flex;
			align-items: center;
			gap: 3rem;
		}
		&__link {
			a {
				cursor: pointer;
				position: relative;
				display: inline-block;
				color: $dark;
				height: 100%;
				width: max-content;
				padding: 1.2rem 0;
				transition: all 0.2s ease;
				&:hover {
					color: $blue;
					transition: all 0.3s ease;
				}
			}
		}
		&__disclaimer {
			padding: 0.8rem 0;
			text-align: center;
			height: 4rem;
			color: $middle-gray;
		}
	}

	@media (max-width: 1110px) {
		.the-footer {
			height: fit-content;
			display: flex;
			align-items: center;
			&__disclaimer {
				display: none;
			}
			&__top {
				flex-direction: column;
				align-items: center;
				width: 100%;
				gap: 0;
				height: fit-content;
			}
			&__links {
				gap: 1rem;
			}
		}
	}

	@media (max-width: 720px) {
		.the-footer {
			background-color: $blue;
			color: $white;
			height: 11rem;
			&__links {
				display: none;
			}
			&__socials {
				flex-direction: column;
				width: 100%;
				max-height: inherit;

				p {
					color: $white;
					grid-column: 1/3;
					margin-right: 0;
				}
				&-group {
					display: flex;
					width: 100%;
					height: 6rem;
					gap: 0;
					a {
						display: flex;
						justify-content: center;
						align-items: center;
						height: 100%;
						width: 100%;
						&:nth-child(-n + 2) {
							position: relative;
							&::after {
								content: "";
								position: absolute;
								top: 0;
								right: 0;
								width: 0.1rem;
								height: 100%;
								background-color: #fff;
							}
						}
					}
					svg {
						height: 5rem;
						width: 5rem;
						path {
							fill: $white;
						}
					}
				}
			}
		}
	}

	@media (max-width: 540px) {
		.the-footer {
			&__socials-group {
				height: 4rem;
				a {
					height: 100%;
					svg {
						height: 100%;
					}
					&:last-child {
						svg {
							height: 90%;
						}
					}
				}
			}
		}
	}
</style>
